Autodesk.Revit.DB.MEPAnalyticalConnectionType.GetAllTypes(Autodesk.Revit.DB.Document)
Gets all the analytical connection types.
doc:
The document where the analytical connection types come from.
Returns:
All the types in this document, empty if none.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018